workspace/InformationRegisters/АукДанныеШапокПодведенияИтогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукДанныеШапокПодведенияИтогов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщийСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/InformationRegisters/АукДанныеШапокПодведенияИтогов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ДобавитьЗапись(пСтруктураЗаписи) Экспорт
		
	сткРез =  АукОбщийСервер.ДобавитьЗаписьВРегистрСведений(пСтруктураЗаписи, "АукДанныеШапокПодведенияИтогов");
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;	
	КонецЕсли;	
	
КонецФункции

Функция УдалитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат АукОбщийСервер.УдалитьНаборЗаписейВРегистреСведений(пСтруктураЗаписи, "АукДанныеШапокПодведенияИтогов");
	
КонецФункции	

Функция ТекущиеДанныеШапкиПодведенияИтоговАукциона(пАукцион) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукДанныеШапокПодведенияИтогов.ОбщаяСумма КАК ОбщаяСумма,
	|	АукДанныеШапокПодведенияИтогов.ОбщийСрок КАК ОбщийСрок
	|ИЗ
	|	РегистрСведений.АукДанныеШапокПодведенияИтогов КАК АукДанныеШапокПодведенияИтогов
	|ГДЕ
	|	АукДанныеШапокПодведенияИтогов.Аукцион = &Аукцион";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
КонецФункции	

Функция СтруктураЗаписи() Экспорт

	сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("Аукцион",		);
	сткРезультат.Вставить("ОбщаяСумма",		);
	сткРезультат.Вставить("ОбщийСрок",		);
	сткРезультат.Вставить("Автор",			?(ЗначениеЗаполнено(ПараметрыСеанса.глТекПользователь),
												ПараметрыСеанса.глТекПользователь,
												ПредопределенноеЗначение("Справочник.Пользователи.Система")));
												
	сткРезультат.Вставить("ДатаЗаписи",		ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	
	Возврат сткРезультат;
	
КонецФункции	

#КонецОбласти
